# shell tools
brew "tmux"
brew "reattach-to-user-namespace"
brew "fish"

# vim tools
brew "neovim"

# emacs
brew "coreutils"
brew "git"
brew "ripgrep"
brew "fd"
brew "llvm"
tap "d12frosted/emacs-plus"
brew "emacs-plus", args: ["without-spacemacs-icon"]

# search tools
brew "the_silver_searcher"
brew "fzf"
brew "ripgrep"

# Source Control Tools
brew "tig"
brew "mercurial"

# databases
cask "postgres"

# languages
# brew "zlib" # needed for pyenv installing
brew "eslint"
brew "asdf"
